[
  {
    "id": 1,
    "heading": "dekodeX",
    "description": "A 10-day online competition designed to evaluate participants' problem-solving abilities. Each day featured a unique challenge, specifically crafted to assess their proficiency in fundamental and commonly-employed data structures and algorithms.",
    "sponsor": "",
    "image": "/EventsImages/dekodex.png",
    "sponsor_img": ""
  },
  {
    "id": 2,
    "heading": "National Science Week Hackathon",
    "description": "An offline hackathon at IIT Kharagpur focused on building a course recommendation website using ML. The platform filtered courses based on CGPA goals, profiles, and interests. It featured intuitive UI design, collaborative development, and expert mentorship.",
    "sponsor": "",
    "image": "/EventsImages/nsw_hack.jpeg",
    "sponsor_img": ""
  },
  {
    "id": 3,
    "heading": "INNOVATE4SWADESHI",
    "description": "An online AI-focused hackathon in partnership with Swadeshi Bytes tackling SME operations, campus interaction, and content creation. It featured three problem statements, mentorship from industry experts, and a prize pool of 50k INR.",
    "sponsor": ["saneobserver"],
    "image": "/EventsImages/Swadeshi_event.png",
    "sponsor_img": ["/EventsImages/Sane.png"]
  },
  {
    "id": 4,
    "heading": "Hack-an-Intern",
    "description": "A major tech event sponsored by Density with 300+ participants exploring AI, blockchain, and emerging tech. Included workshops by industry veterans, hands-on coding, and networking. Prize pool worth 2 lakhs INR for top performers.",
    "sponsor": ["Density"],
    "image": "/EventsImages/density_hackathon.jpg",
    "sponsor_img": ["/EventsImages/density.jpg"]
  },
  {
    "id": 5,
    "heading": "Blockchain Hackathon",
    "description": "An online hackathon by Nuvepro with 400+ participants and 50 teams developing blockchain-based solutions. The event featured expert-led workshops, coding sessions, and industry interactions. Total prize pool was 40k INR.",
    "sponsor": ["Nuvepro"],
    "image": "/EventsImages/blockchain_hackathon.jpg",
    "sponsor_img": ["/EventsImages/nuvepro logo.jpg"]
  },
  {
    "id": 6,
    "heading": "Concordia",
    "description": "A global online hackathon sponsored by Graviton and Concordium with 60 teams and a prize pool over $100k. Participants tackled complex challenges through collaboration, workshops, and networking. Emphasized innovation and professional growth.",
    "image": "/EventsImages/concordia.jpg",
    "sponsor_img": [
      "/EventsImages/concordium_logo.jpg",
      "/EventsImages/graviton logo.jpg"
    ]
  },
  {
    "id": 7,
    "heading": "Web3.0 Summer Training Program",
    "description": "A 4-week online training with Lumos teaching full-stack Web3.0 development. Covered JavaScript, React, blockchain, and smart contracts. Participants engaged in hands-on projects, interactive sessions, and collaborative learning.",
    "sponsor": ["Lumos"],
    "image": "/EventsImages/Lumos_event.jpg",
    "sponsor_img": ["/EventsImages/lumoslabs_logo.jpg"]
  },
  {
    "id": 8,
    "heading": "Web3 & Aptos Session",
    "description": "An online session by Move Developers for 300+ participants exploring Web3 and Aptos. Included deep-dive presentations, practical workshops, and networking with tech professionals. Aimed at bridging gaps in emerging tech.",
    "sponsor": ["Move Developers"],
    "image": "/EventsImages/move event.jpg",
    "sponsor_img": ["/EventsImages/move icon.jpg"]
  }
]
